FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
/*
 * Copyright (c) 2010 - 2021, Nordic Semiconductor ASA All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     nrf52805.h
 * @brief    CMSIS HeaderFile
 * @version  1
 * @date     19. November 2021
 * @note     Generated by SVDConv V3.3.35 on Friday, 19.11.2021 12:44:56
 *           from File 'nrf52805.svd',
 *           last modified on Friday, 19.11.2021 11:44:55
 */



/** @addtogroup Nordic Semiconductor
 * @{
 */


/** @addtogroup nrf52805
 * @{
 */


#ifndef NRF52805_H
    #define NRF52805_H

    #ifdef __cplusplus
    extern "C" {
    #endif


/** @addtogroup Configuration_of_CMSIS
 * @{
 */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

    typedef enum
    {
/* =======================================  ARM Cortex-M4 Specific Interrupt Numbers  ======================================== */
        Reset_IRQn = -15,                       /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
        NonMaskableInt_IRQn = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
        HardFault_IRQn = -13,                   /*!< -13  Hard Fault, all classes of Fault                                     */
        MemoryManagement_IRQn = -12,            /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                 *   and No Match                                                              */
        BusFault_IRQn = -11,                    /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                 *   related Fault                                                             */
        UsageFault_IRQn = -10,                  /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
        SVCall_IRQn = -5,                       /*!< -5 System Service Call via SVC instruction                                */
        DebugMonitor_IRQn = -4,                 /*!< -4 Debug Monitor                                                          */
        PendSV_IRQn = -2,                       /*!< -2 Pendable request for system service                                    */
        SysTick_IRQn = -1,                      /*!< -1 System Tick Timer                                                      */
/* ==========================================  nrf52805 Specific Interrupt Numbers  ========================================== */
        POWER_CLOCK_IRQn = 0,                   /*!< 0  POWER_CLOCK                                                            */
        RADIO_IRQn = 1,                         /*!< 1  RADIO                                                                  */
        UARTE0_UART0_IRQn = 2,                  /*!< 2  UARTE0_UART0                                                           */
        TWIM0_TWIS0_TWI0_IRQn = 3,              /*!< 3  TWIM0_TWIS0_TWI0                                                       */
        SPIM0_SPIS0_SPI0_IRQn = 4,              /*!< 4  SPIM0_SPIS0_SPI0                                                       */
        GPIOTE_IRQn = 6,                        /*!< 6  GPIOTE                                                                 */
        SAADC_IRQn = 7,                         /*!< 7  SAADC                                                                  */
        TIMER0_IRQn = 8,                        /*!< 8  TIMER0                                                                 */
        TIMER1_IRQn = 9,                        /*!< 9  TIMER1                                                                 */
        TIMER2_IRQn = 10,                       /*!< 10 TIMER2                                                                 */
        RTC0_IRQn = 11,                         /*!< 11 RTC0                                                                   */
        TEMP_IRQn = 12,                         /*!< 12 TEMP                                                                   */
        RNG_IRQn = 13,                          /*!< 13 RNG                                                                    */
        ECB_IRQn = 14,                          /*!< 14 ECB                                                                    */
        CCM_AAR_IRQn = 15,                      /*!< 15 CCM_AAR                                                                */
        WDT_IRQn = 16,                          /*!< 16 WDT                                                                    */
        RTC1_IRQn = 17,                         /*!< 17 RTC1                                                                   */
        QDEC_IRQn = 18,                         /*!< 18 QDEC                                                                   */
        SWI0_EGU0_IRQn = 20,                    /*!< 20 SWI0_EGU0                                                              */
        SWI1_EGU1_IRQn = 21,                    /*!< 21 SWI1_EGU1                                                              */
        SWI2_IRQn = 22,                         /*!< 22 SWI2                                                                   */
        SWI3_IRQn = 23,                         /*!< 23 SWI3                                                                   */
        SWI4_IRQn = 24,                         /*!< 24 SWI4                                                                   */
        SWI5_IRQn = 25                          /*!< 25 SWI5                                                                   */
    } IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M4 Processor and Core Peripherals  =========================== */
    #define __CM4_REV                 0x0001U   /*!< CM4 Core Revision                                                         */
    #define __DSP_PRESENT             1         /*!< DSP present or not                                                        */
    #define __VTOR_PRESENT            1         /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
    #define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels                                   */
    #define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used                              */
    #define __MPU_PRESENT             1         /*!< MPU present                                                               */
    #define __FPU_PRESENT             0         /*!< FPU present                                                               */


/** @} */ /* End of group Configuration_of_CMSIS */

    #include "core_cm4.h"                       /*!< ARM Cortex-M4 processor and core peripherals                              */
    #include "system_nrf52805.h"                /*!< nrf52805 System                                                           */

    #ifndef __IM                                /*!< Fallback for older CMSIS versions                                         */
        #define __IM     __I
    #endif
    #ifndef __OM                                /*!< Fallback for older CMSIS versions                                         */
        #define __OM     __O
    #endif
    #ifndef __IOM                               /*!< Fallback for older CMSIS versions                                         */
        #define __IOM    __IO
    #endif


/* ========================================  Start of section using anonymous unions  ======================================== */
    #if defined( __CC_ARM )
        #pragma push
        #pragma anon_unions
    #elif defined( __ICCARM__ )
        #pragma language=extended
    #elif defined( __ARMCC_VERSION ) && ( __ARMCC_VERSION >= 6010050 )
        #pragma clang diagnostic push
        #pragma clang diagnostic ignored "-Wc11-extensions"
        #pragma clang diagnostic ignored "-Wreserved-id-macro"
        #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
        #pragma clang diagnostic ignored "-Wnested-anon-types"
    #elif defined( __GNUC__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TMS470__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TASKING__ )
        #pragma warning 586
    #elif defined( __CSMC__ )
        /* anonymous unions are enabled by default */
    #else  /* if defined( __CC_ARM ) */
        #warning Not supported compiler type
    #endif /* if defined( __CC_ARM ) */


/* =========================================================================================================================== */
/* ================                              Device Specific Cluster Section                              ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_clusters
 * @{
 */


/**
 * @brief FICR_INFO [INFO] (Device info)
 */
    typedef struct
    {
        __IM uint32_t PART;                     /*!< (@ 0x00000000) Part code                                                  */
        __IM uint32_t VARIANT;                  /*!< (@ 0x00000004) Part variant, hardware version and production
                                                 *                  configuration                                              */
        __IM uint32_t PACKAGE;                  /*!< (@ 0x00000008) Package option                                             */
        __IM uint32_t RAM;                      /*!< (@ 0x0000000C) RAM variant                                                */
        __IM uint32_t FLASH;                    /*!< (@ 0x00000010) Flash variant                                              */
    } FICR_INFO_Type;                           /*!< Size = 20 (0x14)                                                          */


/**
 * @brief FICR_TEMP [TEMP] (Registers storing factory TEMP module linearization coefficients)
 */
    typedef struct
    {
        __IM uint32_t A0;                       /*!< (@ 0x00000000) Slope definition A0                                        */
        __IM uint32_t A1;                       /*!< (@ 0x00000004) Slope definition A1                                        */
        __IM uint32_t A2;                       /*!< (@ 0x00000008) Slope definition A2                                        */
        __IM uint32_t A3;                       /*!< (@ 0x0000000C) Slope definition A3                                        */
        __IM uint32_t A4;                       /*!< (@ 0x00000010) Slope definition A4                                        */
        __IM uint32_t A5;                       /*!< (@ 0x00000014) Slope definition A5                                        */
        __IM uint32_t B0;                       /*!< (@ 0x00000018) Y-intercept B0                                             */
        __IM uint32_t B1;                       /*!< (@ 0x0000001C) Y-intercept B1                                             */
        __IM uint32_t B2;                       /*!< (@ 0x00000020) Y-intercept B2                                             */
        __IM uint32_t B3;                       /*!< (@ 0x00000024) Y-intercept B3                                             */
        __IM uint32_t B4;                       /*!< (@ 0x00000028) Y-intercept B4                                             */
        __IM uint32_t B5;                       /*!< (@ 0x0000002C) Y-intercept B5                                             */
        __IM uint32_t T0;                       /*!< (@ 0x00000030) Segment end T0                                             */
        __IM uint32_t T1;                       /*!< (@ 0x00000034) Segment end T1                                             */
        __IM uint32_t T2;                       /*!< (@ 0x00000038) Segment end T2                                             */
        __IM uint32_t T3;                       /*!< (@ 0x0000003C) Segment end T3                                             */
        __IM uint32_t T4;                       /*!< (@ 0x00000040) Segment end T4                                             */
    } FICR_TEMP_Type;                           /*!< Size = 68 (0x44)                                                          */


/**
 * @brief POWER_RAM [RAM] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t POWER;                   /*!< (@ 0x00000000) Description cluster: RAMn power control register.
                                                 *                  The RAM size will vary depending on product
                                                 *                  variant, and the RAMn register will only
                                                 *                  be present if the corresponding RAM AHB
                                                 *                  slave is present on the device.                            */
        __OM uint32_t POWERSET;                 /*!< (@ 0x00000004) Description cluster: RAMn power control set register       */
        __OM uint32_t POWERCLR;                 /*!< (@ 0x00000008) Description cluster: RAMn power control clear
                                                 *                  register                                                   */
        __IM uint32_t RESERVED;
    } POWER_RAM_Type;                           /*!< Size = 16 (0x10)                                                          */


/**
 * @brief UART_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t RTS;                     /*!< (@ 0x00000000) Pin select for RTS                                         */
        __IOM uint32_t TXD;                     /*!< (@ 0x00000004) Pin select for TXD                                         */
        __IOM uint32_t CTS;                     /*!< (@ 0x00000008) Pin select for CTS                                         */
        __IOM uint32_t RXD;                     /*!< (@ 0x0000000C) Pin select for RXD                                         */
    } UART_PSEL_Type;                           /*!< Size = 16 (0x10)                                                          */


/**
 * @brief UARTE_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t RTS;                     /*!< (@ 0x00000000) Pin select for RTS signal                                  */
        __IOM uint32_t TXD;                     /*!< (@ 0x00000004) Pin select for TXD signal                                  */
        __IOM uint32_t CTS;                     /*!< (@ 0x00000008) Pin select for CTS signal                                  */
        __IOM uint32_t RXD;                     /*!< (@ 0x0000000C) Pin select for RXD signal                                  */
    } UARTE_PSEL_Type;                          /*!< Size = 16 (0x10)                                                          */


/**
 * @brief UARTE_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
    } UARTE_RXD_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief UARTE_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
    } UARTE_TXD_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief TWI_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL                                         */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA                                         */
    } TWI_PSEL_Type;                            /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIM_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL signal                                  */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA signal                                  */
    } TWIM_PSEL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIM_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIM_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIM_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIM_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIS_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCL;                     /*!< (@ 0x00000000) Pin select for SCL signal                                  */
        __IOM uint32_t SDA;                     /*!< (@ 0x00000004) Pin select for SDA signal                                  */
    } TWIS_PSEL_Type;                           /*!< Size = 8 (0x8)                                                            */


/**
 * @brief TWIS_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) RXD Data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in RXD buffer                      */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last RXD transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIS_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief TWIS_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) TXD Data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in TXD buffer                      */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last TXD transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } TWIS_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPI_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCK;                     /*!< (@ 0x00000000) Pin select for SCK                                         */
        __IOM uint32_t MOSI;                    /*!< (@ 0x00000004) Pin select for MOSI signal                                 */
        __IOM uint32_t MISO;                    /*!< (@ 0x00000008) Pin select for MISO signal                                 */
    } SPI_PSEL_Type;                            /*!< Size = 12 (0xc)                                                           */


