FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
/**
 * @brief SPIM_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCK;                     /*!< (@ 0x00000000) Pin select for SCK                                         */
        __IOM uint32_t MOSI;                    /*!< (@ 0x00000004) Pin select for MOSI signal                                 */
        __IOM uint32_t MISO;                    /*!< (@ 0x00000008) Pin select for MISO signal                                 */
    } SPIM_PSEL_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief SPIM_RXD [RXD] (RXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIM_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIM_TXD [TXD] (TXD EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transferred in the last transaction        */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIM_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIS_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t SCK;                     /*!< (@ 0x00000000) Pin select for SCK                                         */
        __IOM uint32_t MISO;                    /*!< (@ 0x00000004) Pin select for MISO signal                                 */
        __IOM uint32_t MOSI;                    /*!< (@ 0x00000008) Pin select for MOSI signal                                 */
        __IOM uint32_t CSN;                     /*!< (@ 0x0000000C) Pin select for CSN signal                                  */
    } SPIS_PSEL_Type;                           /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIS_RXD [RXD] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) RXD data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in receive buffer                  */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes received in last granted transaction       */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIS_RXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SPIS_TXD [TXD] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) TXD data pointer                                           */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of bytes in transmit buffer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of bytes transmitted in last granted transaction    */
        __IOM uint32_t LIST;                    /*!< (@ 0x0000000C) EasyDMA list type                                          */
    } SPIS_TXD_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SAADC_EVENTS_CH [EVENTS_CH] (Peripheral events.)
 */
    typedef struct
    {
        __IOM uint32_t LIMITH;                  /*!< (@ 0x00000000) Description cluster: Last results is equal or
                                                 *                  above CH[n].LIMIT.HIGH                                     */
        __IOM uint32_t LIMITL;                  /*!< (@ 0x00000004) Description cluster: Last results is equal or
                                                 *                  below CH[n].LIMIT.LOW                                      */
    } SAADC_EVENTS_CH_Type;                     /*!< Size = 8 (0x8)                                                            */


/**
 * @brief SAADC_CH [CH] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t PSELP;                   /*!< (@ 0x00000000) Description cluster: Input positive pin selection
                                                 *                  for CH[n]                                                  */
        __IOM uint32_t PSELN;                   /*!< (@ 0x00000004) Description cluster: Input negative pin selection
                                                 *                  for CH[n]                                                  */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000008) Description cluster: Input configuration for
                                                 *                  CH[n]                                                      */
        __IOM uint32_t LIMIT;                   /*!< (@ 0x0000000C) Description cluster: High/low limits for event
                                                 *                  monitoring a channel                                       */
    } SAADC_CH_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
 * @brief SAADC_RESULT [RESULT] (RESULT EasyDMA channel)
 */
    typedef struct
    {
        __IOM uint32_t PTR;                     /*!< (@ 0x00000000) Data pointer                                               */
        __IOM uint32_t MAXCNT;                  /*!< (@ 0x00000004) Maximum number of buffer words to transfer                 */
        __IM uint32_t AMOUNT;                   /*!< (@ 0x00000008) Number of buffer words transferred since last
                                                 *                  START                                                      */
    } SAADC_RESULT_Type;                        /*!< Size = 12 (0xc)                                                           */


/**
 * @brief QDEC_PSEL [PSEL] (Unspecified)
 */
    typedef struct
    {
        __IOM uint32_t LED;                     /*!< (@ 0x00000000) Pin select for LED signal                                  */
        __IOM uint32_t A;                       /*!< (@ 0x00000004) Pin select for A signal                                    */
        __IOM uint32_t B;                       /*!< (@ 0x00000008) Pin select for B signal                                    */
    } QDEC_PSEL_Type;                           /*!< Size = 12 (0xc)                                                           */


/**
 * @brief PPI_TASKS_CHG [TASKS_CHG] (Channel group tasks)
 */
    typedef struct
    {
        __OM uint32_t EN;                       /*!< (@ 0x00000000) Description cluster: Enable channel group n                */
        __OM uint32_t DIS;                      /*!< (@ 0x00000004) Description cluster: Disable channel group n               */
    } PPI_TASKS_CHG_Type;                       /*!< Size = 8 (0x8)                                                            */


/**
 * @brief PPI_CH [CH] (PPI Channel)
 */
    typedef struct
    {
        __IOM uint32_t EEP;                     /*!< (@ 0x00000000) Description cluster: Channel n event endpoint              */
        __IOM uint32_t TEP;                     /*!< (@ 0x00000004) Description cluster: Channel n task endpoint               */
    } PPI_CH_Type;                              /*!< Size = 8 (0x8)                                                            */


/**
 * @brief PPI_FORK [FORK] (Fork)
 */
    typedef struct
    {
        __IOM uint32_t TEP;                     /*!< (@ 0x00000000) Description cluster: Channel n task endpoint               */
    } PPI_FORK_Type;                            /*!< Size = 4 (0x4)                                                            */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
 * @{
 */



/* =========================================================================================================================== */
/* ================                                           FICR                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Factory information configuration registers (FICR)
 */

    typedef struct                              /*!< (@ 0x10000000) FICR Structure                                             */
    {
        __IM uint32_t RESERVED[ 4 ];
        __IM uint32_t CODEPAGESIZE;             /*!< (@ 0x00000010) Code memory page size                                      */
        __IM uint32_t CODESIZE;                 /*!< (@ 0x00000014) Code memory size                                           */
        __IM uint32_t RESERVED1[ 18 ];
        __IM uint32_t DEVICEID[ 2 ];            /*!< (@ 0x00000060) Description collection: Device identifier                  */
        __IM uint32_t RESERVED2[ 6 ];
        __IM uint32_t ER[ 4 ];                  /*!< (@ 0x00000080) Description collection: Encryption root, word
                                                 *                  n                                                          */
        __IM uint32_t IR[ 4 ];                  /*!< (@ 0x00000090) Description collection: Identity root, word n              */
        __IM uint32_t DEVICEADDRTYPE;           /*!< (@ 0x000000A0) Device address type                                        */
        __IM uint32_t DEVICEADDR[ 2 ];          /*!< (@ 0x000000A4) Description collection: Device address n                   */
        __IM uint32_t RESERVED3[ 21 ];
        __IM FICR_INFO_Type INFO;               /*!< (@ 0x00000100) Device info                                                */
        __IM uint32_t RESERVED4[ 188 ];
        __IM FICR_TEMP_Type TEMP;               /*!< (@ 0x00000404) Registers storing factory TEMP module linearization
                                                 *                  coefficients                                               */
    } NRF_FICR_Type;                            /*!< Size = 1096 (0x448)                                                       */



/* =========================================================================================================================== */
/* ================                                           UICR                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief User information configuration registers (UICR)
 */

    typedef struct                              /*!< (@ 0x10001000) UICR Structure                                             */
    {
        __IM uint32_t RESERVED[ 5 ];
        __IOM uint32_t NRFFW[ 13 ];             /*!< (@ 0x00000014) Description collection: Reserved for Nordic firmware
                                                 *                  design                                                     */
        __IM uint32_t RESERVED1[ 2 ];
        __IOM uint32_t NRFHW[ 12 ];             /*!< (@ 0x00000050) Description collection: Reserved for Nordic hardware
                                                 *                  design                                                     */
        __IOM uint32_t CUSTOMER[ 32 ];          /*!< (@ 0x00000080) Description collection: Reserved for customer              */
        __IOM uint32_t NRFMDK[ 8 ];             /*!< (@ 0x00000100) Description collection: Reserved for Nordic MDK            */
        __IM uint32_t RESERVED2[ 56 ];
        __IOM uint32_t PSELRESET[ 2 ];          /*!< (@ 0x00000200) Description collection: Mapping of the nRESET
                                                 *                  function (see POWER chapter for details)                   */
        __IOM uint32_t APPROTECT;               /*!< (@ 0x00000208) Access port protection                                     */
    } NRF_UICR_Type;                            /*!< Size = 524 (0x20c)                                                        */



/* =========================================================================================================================== */
/* ================                                           BPROT                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Block Protect (BPROT)
 */

    typedef struct                              /*!< (@ 0x40000000) BPROT Structure                                            */
    {
        __IM uint32_t RESERVED[ 384 ];
        __IOM uint32_t CONFIG0;                 /*!< (@ 0x00000600) Block protect configuration register 0                     */
        __IOM uint32_t CONFIG1;                 /*!< (@ 0x00000604) Block protect configuration register 1                     */
        __IOM uint32_t DISABLEINDEBUG;          /*!< (@ 0x00000608) Disable protection mechanism in debug mode                 */
    } NRF_BPROT_Type;                           /*!< Size = 1548 (0x60c)                                                       */



/* =========================================================================================================================== */
/* ================                                         APPROTECT                                         ================ */
/* =========================================================================================================================== */


/**
 * @brief Only for emulation on devices that support hardened AP-PROTECT. (APPROTECT)
 */

    typedef struct                              /*!< (@ 0x40000000) APPROTECT Structure                                        */
    {
        __IM uint32_t RESERVED[ 340 ];
        __IOM uint32_t FORCEPROTECT;            /*!< (@ 0x00000550) Software force enable APPROTECT mechanism until
                                                 *                  next reset.                                                */
        __IM uint32_t RESERVED1;
        __IOM uint32_t DISABLE;                 /*!< (@ 0x00000558) Software disable APPROTECT mechanism                       */
    } NRF_APPROTECT_Type;                       /*!< Size = 1372 (0x55c)                                                       */



/* =========================================================================================================================== */
/* ================                                           CLOCK                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Clock control (CLOCK)
 */

    typedef struct                              /*!< (@ 0x40000000) CLOCK Structure                                            */
    {
        __OM uint32_t TASKS_HFCLKSTART;         /*!< (@ 0x00000000) Start HFCLK crystal oscillator                             */
        __OM uint32_t TASKS_HFCLKSTOP;          /*!< (@ 0x00000004) Stop HFCLK crystal oscillator                              */
        __OM uint32_t TASKS_LFCLKSTART;         /*!< (@ 0x00000008) Start LFCLK source                                         */
        __OM uint32_t TASKS_LFCLKSTOP;          /*!< (@ 0x0000000C) Stop LFCLK source                                          */
        __OM uint32_t TASKS_CAL;                /*!< (@ 0x00000010) Start calibration of LFRC oscillator                       */
        __OM uint32_t TASKS_CTSTART;            /*!< (@ 0x00000014) Start calibration timer                                    */
        __OM uint32_t TASKS_CTSTOP;             /*!< (@ 0x00000018) Stop calibration timer                                     */
        __IM uint32_t RESERVED[ 57 ];
        __IOM uint32_t EVENTS_HFCLKSTARTED;     /*!< (@ 0x00000100) HFCLK oscillator started                                   */
        __IOM uint32_t EVENTS_LFCLKSTARTED;     /*!< (@ 0x00000104) LFCLK started                                              */
        __IM uint32_t RESERVED1;
        __IOM uint32_t EVENTS_DONE;             /*!< (@ 0x0000010C) Calibration of LFCLK RC oscillator complete event          */
        __IOM uint32_t EVENTS_CTTO;             /*!< (@ 0x00000110) Calibration timer timeout                                  */
        __IM uint32_t RESERVED2[ 124 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED3[ 63 ];
        __IM uint32_t HFCLKRUN;                 /*!< (@ 0x00000408) Status indicating that HFCLKSTART task has been
                                                 *                  triggered                                                  */
        __IM uint32_t HFCLKSTAT;                /*!< (@ 0x0000040C) HFCLK status                                               */
        __IM uint32_t RESERVED4;
        __IM uint32_t LFCLKRUN;                 /*!< (@ 0x00000414) Status indicating that LFCLKSTART task has been
                                                 *                  triggered                                                  */
        __IM uint32_t LFCLKSTAT;                /*!< (@ 0x00000418) LFCLK status                                               */
        __IM uint32_t LFCLKSRCCOPY;             /*!< (@ 0x0000041C) Copy of LFCLKSRC register, set when LFCLKSTART
                                                 *                  task was triggered                                         */
        __IM uint32_t RESERVED5[ 62 ];
        __IOM uint32_t LFCLKSRC;                /*!< (@ 0x00000518) Clock source for the LFCLK                                 */
        __IM uint32_t RESERVED6[ 7 ];
        __IOM uint32_t CTIV;                    /*!< (@ 0x00000538) Calibration timer interval                                 */
    } NRF_CLOCK_Type;                           /*!< Size = 1340 (0x53c)                                                       */



/* =========================================================================================================================== */
/* ================                                           POWER                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Power control (POWER)
 */

    typedef struct                              /*!< (@ 0x40000000) POWER Structure                                            */
    {
        __IM uint32_t RESERVED[ 30 ];
        __OM uint32_t TASKS_CONSTLAT;           /*!< (@ 0x00000078) Enable Constant Latency mode                               */
        __OM uint32_t TASKS_LOWPWR;             /*!< (@ 0x0000007C) Enable Low-power mode (variable latency)                   */
        __IM uint32_t RESERVED1[ 34 ];
        __IOM uint32_t EVENTS_POFWARN;          /*!< (@ 0x00000108) Power failure warning                                      */
        __IM uint32_t RESERVED2[ 2 ];
        __IOM uint32_t EVENTS_SLEEPENTER;       /*!< (@ 0x00000114) CPU entered WFI/WFE sleep                                  */
        __IOM uint32_t EVENTS_SLEEPEXIT;        /*!< (@ 0x00000118) CPU exited WFI/WFE sleep                                   */
        __IM uint32_t RESERVED3[ 122 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 61 ];
        __IOM uint32_t RESETREAS;               /*!< (@ 0x00000400) Reset reason                                               */
        __IM uint32_t RESERVED5[ 63 ];
        __OM uint32_t SYSTEMOFF;                /*!< (@ 0x00000500) System OFF register                                        */
        __IM uint32_t RESERVED6[ 3 ];
        __IOM uint32_t POFCON;                  /*!< (@ 0x00000510) Power failure comparator configuration                     */
        __IM uint32_t RESERVED7[ 2 ];
        __IOM uint32_t GPREGRET;                /*!< (@ 0x0000051C) General purpose retention register                         */
        __IOM uint32_t GPREGRET2;               /*!< (@ 0x00000520) General purpose retention register                         */
        __IM uint32_t RESERVED8[ 21 ];
        __IOM uint32_t DCDCEN;                  /*!< (@ 0x00000578) DC/DC enable register                                      */
        __IM uint32_t RESERVED9[ 225 ];
        __IOM POWER_RAM_Type RAM[ 8 ];          /*!< (@ 0x00000900) Unspecified                                                */
    } NRF_POWER_Type;                           /*!< Size = 2432 (0x980)                                                       */



/* =========================================================================================================================== */
/* ================                                            P0                                             ================ */
/* =========================================================================================================================== */


/**
 * @brief GPIO Port (P0)
 */

