FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
    typedef struct                              /*!< (@ 0x40002000) UARTE0 Structure                                           */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start UART receiver                                        */
        __OM uint32_t TASKS_STOPRX;             /*!< (@ 0x00000004) Stop UART receiver                                         */
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start UART transmitter                                     */
        __OM uint32_t TASKS_STOPTX;             /*!< (@ 0x0000000C) Stop UART transmitter                                      */
        __IM uint32_t RESERVED[ 7 ];
        __OM uint32_t TASKS_FLUSHRX;            /*!< (@ 0x0000002C) Flush RX FIFO into RX buffer                               */
        __IM uint32_t RESERVED1[ 52 ];
        __IOM uint32_t EVENTS_CTS;              /*!< (@ 0x00000100) CTS is activated (set low). Clear To Send.                 */
        __IOM uint32_t EVENTS_NCTS;             /*!< (@ 0x00000104) CTS is deactivated (set high). Not Clear To Send.          */
        __IOM uint32_t EVENTS_RXDRDY;           /*!< (@ 0x00000108) Data received in RXD (but potentially not yet
                                                 *                  transferred to Data RAM)                                   */
        __IM uint32_t RESERVED2;
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) Receive buffer is filled up                                */
        __IM uint32_t RESERVED3[ 2 ];
        __IOM uint32_t EVENTS_TXDRDY;           /*!< (@ 0x0000011C) Data sent from TXD                                         */
        __IOM uint32_t EVENTS_ENDTX;            /*!< (@ 0x00000120) Last TX byte transmitted                                   */
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) Error detected                                             */
        __IM uint32_t RESERVED4[ 7 ];
        __IOM uint32_t EVENTS_RXTO;             /*!< (@ 0x00000144) Receiver timeout                                           */
        __IM uint32_t RESERVED5;
        __IOM uint32_t EVENTS_RXSTARTED;        /*!< (@ 0x0000014C) UART receiver has started                                  */
        __IOM uint32_t EVENTS_TXSTARTED;        /*!< (@ 0x00000150) UART transmitter has started                               */
        __IM uint32_t RESERVED6;
        __IOM uint32_t EVENTS_TXSTOPPED;        /*!< (@ 0x00000158) Transmitter stopped                                        */
        __IM uint32_t RESERVED7[ 41 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED8[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED9[ 93 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x00000480) Error source This register is read/write one
                                                 *                  to clear.                                                  */
        __IM uint32_t RESERVED10[ 31 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable UART                                                */
        __IM uint32_t RESERVED11;
        __IOM UARTE_PSEL_Type PSEL;             /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED12[ 3 ];
        __IOM uint32_t BAUDRATE;                /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                 *                  selected.                                                  */
        __IM uint32_t RESERVED13[ 3 ];
        __IOM UARTE_RXD_Type RXD;               /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IM uint32_t RESERVED14;
        __IOM UARTE_TXD_Type TXD;               /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IM uint32_t RESERVED15[ 7 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x0000056C) Configuration of parity and hardware flow control          */
    } NRF_UARTE_Type;                           /*!< Size = 1392 (0x570)                                                       */



/* =========================================================================================================================== */
/* ================                                           TWI0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Interface (TWI0)
 */

    typedef struct                              /*!< (@ 0x40003000) TWI0 Structure                                             */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start TWI receive sequence                                 */
        __IM uint32_t RESERVED;
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start TWI transmit sequence                                */
        __IM uint32_t RESERVED1[ 2 ];
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop TWI transaction                                       */
        __IM uint32_t RESERVED2;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume TWI transaction                                     */
        __IM uint32_t RESERVED3[ 56 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) TWI stopped                                                */
        __IOM uint32_t EVENTS_RXDREADY;         /*!< (@ 0x00000108) TWI RXD byte received                                      */
        __IM uint32_t RESERVED4[ 4 ];
        __IOM uint32_t EVENTS_TXDSENT;          /*!< (@ 0x0000011C) TWI TXD byte sent                                          */
        __IM uint32_t RESERVED5;
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) TWI error                                                  */
        __IM uint32_t RESERVED6[ 4 ];
        __IOM uint32_t EVENTS_BB;               /*!< (@ 0x00000138) TWI byte boundary, generated before each byte
                                                 *                  that is sent or received                                   */
        __IM uint32_t RESERVED7[ 3 ];
        __IOM uint32_t EVENTS_SUSPENDED;        /*!< (@ 0x00000148) TWI entered the suspended state                            */
        __IM uint32_t RESERVED8[ 45 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED9[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED10[ 110 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x000004C4) Error source                                               */
        __IM uint32_t RESERVED11[ 14 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable TWI                                                 */
        __IM uint32_t RESERVED12;
        __IOM TWI_PSEL_Type PSEL;               /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED13[ 2 ];
        __IM uint32_t RXD;                      /*!< (@ 0x00000518) RXD register                                               */
        __IOM uint32_t TXD;                     /*!< (@ 0x0000051C) TXD register                                               */
        __IM uint32_t RESERVED14;
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED15[ 24 ];
        __IOM uint32_t ADDRESS;                 /*!< (@ 0x00000588) Address used in the TWI transfer                           */
    } NRF_TWI_Type;                             /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                           TWIM0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Master Interface with EasyDMA (TWIM0)
 */

