FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
    typedef struct                              /*!< (@ 0x40003000) TWIM0 Structure                                            */
    {
        __OM uint32_t TASKS_STARTRX;            /*!< (@ 0x00000000) Start TWI receive sequence                                 */
        __IM uint32_t RESERVED;
        __OM uint32_t TASKS_STARTTX;            /*!< (@ 0x00000008) Start TWI transmit sequence                                */
        __IM uint32_t RESERVED1[ 2 ];
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop TWI transaction. Must be issued while the
                                                 *                  TWI master is not suspended.                               */
        __IM uint32_t RESERVED2;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume TWI transaction                                     */
        __IM uint32_t RESERVED3[ 56 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) TWI stopped                                                */
        __IM uint32_t RESERVED4[ 7 ];
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) TWI error                                                  */
        __IM uint32_t RESERVED5[ 8 ];
        __IOM uint32_t EVENTS_SUSPENDED;        /*!< (@ 0x00000148) SUSPEND task has been issued, TWI traffic is
                                                 *                  now suspended.                                             */
        __IOM uint32_t EVENTS_RXSTARTED;        /*!< (@ 0x0000014C) Receive sequence started                                   */
        __IOM uint32_t EVENTS_TXSTARTED;        /*!< (@ 0x00000150) Transmit sequence started                                  */
        __IM uint32_t RESERVED6[ 2 ];
        __IOM uint32_t EVENTS_LASTRX;           /*!< (@ 0x0000015C) Byte boundary, starting to receive the last byte           */
        __IOM uint32_t EVENTS_LASTTX;           /*!< (@ 0x00000160) Byte boundary, starting to transmit the last
                                                 *                  byte                                                       */
        __IM uint32_t RESERVED7[ 39 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED8[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED9[ 110 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x000004C4) Error source                                               */
        __IM uint32_t RESERVED10[ 14 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable TWIM                                                */
        __IM uint32_t RESERVED11;
        __IOM TWIM_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED12[ 5 ];
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED13[ 3 ];
        __IOM TWIM_RXD_Type RXD;                /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IOM TWIM_TXD_Type TXD;                /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IM uint32_t RESERVED14[ 13 ];
        __IOM uint32_t ADDRESS;                 /*!< (@ 0x00000588) Address used in the TWI transfer                           */
    } NRF_TWIM_Type;                            /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                           TWIS0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief I2C compatible Two-Wire Slave Interface with EasyDMA (TWIS0)
 */

    typedef struct                              /*!< (@ 0x40003000) TWIS0 Structure                                            */
    {
        __IM uint32_t RESERVED[ 5 ];
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop TWI transaction                                       */
        __IM uint32_t RESERVED1;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend TWI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume TWI transaction                                     */
        __IM uint32_t RESERVED2[ 3 ];
        __OM uint32_t TASKS_PREPARERX;          /*!< (@ 0x00000030) Prepare the TWI slave to respond to a write command        */
        __OM uint32_t TASKS_PREPARETX;          /*!< (@ 0x00000034) Prepare the TWI slave to respond to a read command         */
        __IM uint32_t RESERVED3[ 51 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) TWI stopped                                                */
        __IM uint32_t RESERVED4[ 7 ];
        __IOM uint32_t EVENTS_ERROR;            /*!< (@ 0x00000124) TWI error                                                  */
        __IM uint32_t RESERVED5[ 9 ];
        __IOM uint32_t EVENTS_RXSTARTED;        /*!< (@ 0x0000014C) Receive sequence started                                   */
        __IOM uint32_t EVENTS_TXSTARTED;        /*!< (@ 0x00000150) Transmit sequence started                                  */
        __IM uint32_t RESERVED6[ 4 ];
        __IOM uint32_t EVENTS_WRITE;            /*!< (@ 0x00000164) Write command received                                     */
        __IOM uint32_t EVENTS_READ;             /*!< (@ 0x00000168) Read command received                                      */
        __IM uint32_t RESERVED7[ 37 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED8[ 63 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED9[ 113 ];
        __IOM uint32_t ERRORSRC;                /*!< (@ 0x000004D0) Error source                                               */
        __IM uint32_t MATCH;                    /*!< (@ 0x000004D4) Status register indicating which address had
                                                 *                  a match                                                    */
        __IM uint32_t RESERVED10[ 10 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable TWIS                                                */
        __IM uint32_t RESERVED11;
        __IOM TWIS_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED12[ 9 ];
        __IOM TWIS_RXD_Type RXD;                /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IOM TWIS_TXD_Type TXD;                /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IM uint32_t RESERVED13[ 13 ];
        __IOM uint32_t ADDRESS[ 2 ];            /*!< (@ 0x00000588) Description collection: TWI slave address n                */
        __IM uint32_t RESERVED14;
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000594) Configuration register for the address match
                                                 *                  mechanism                                                  */
        __IM uint32_t RESERVED15[ 10 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Over-read character. Character sent out in case
                                                 *                  of an over-read of the transmit buffer.                    */
    } NRF_TWIS_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Serial Peripheral Interface (SPI0)
 */

    typedef struct                              /*!< (@ 0x40004000) SPI0 Structure                                             */
    {
        __IM uint32_t RESERVED[ 66 ];
        __IOM uint32_t EVENTS_READY;            /*!< (@ 0x00000108) TXD byte sent and RXD byte received                        */
        __IM uint32_t RESERVED1[ 126 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED2[ 125 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable SPI                                                 */
        __IM uint32_t RESERVED3;
        __IOM SPI_PSEL_Type PSEL;               /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED4;
        __IM uint32_t RXD;                      /*!< (@ 0x00000518) RXD register                                               */
        __IOM uint32_t TXD;                     /*!< (@ 0x0000051C) TXD register                                               */
        __IM uint32_t RESERVED5;
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) SPI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED6[ 11 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000554) Configuration register                                     */
    } NRF_SPI_Type;                             /*!< Size = 1368 (0x558)                                                       */



/* =========================================================================================================================== */
/* ================                                           SPIM0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Serial Peripheral Interface Master with EasyDMA (SPIM0)
 */

