FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
    typedef struct                              /*!< (@ 0x40004000) SPIM0 Structure                                            */
    {
        __IM uint32_t RESERVED[ 4 ];
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000010) Start SPI transaction                                      */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000014) Stop SPI transaction                                       */
        __IM uint32_t RESERVED1;
        __OM uint32_t TASKS_SUSPEND;            /*!< (@ 0x0000001C) Suspend SPI transaction                                    */
        __OM uint32_t TASKS_RESUME;             /*!< (@ 0x00000020) Resume SPI transaction                                     */
        __IM uint32_t RESERVED2[ 56 ];
        __IOM uint32_t EVENTS_STOPPED;          /*!< (@ 0x00000104) SPI transaction has stopped                                */
        __IM uint32_t RESERVED3[ 2 ];
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) End of RXD buffer reached                                  */
        __IM uint32_t RESERVED4;
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x00000118) End of RXD buffer and TXD buffer reached                   */
        __IM uint32_t RESERVED5;
        __IOM uint32_t EVENTS_ENDTX;            /*!< (@ 0x00000120) End of TXD buffer reached                                  */
        __IM uint32_t RESERVED6[ 10 ];
        __IOM uint32_t EVENTS_STARTED;          /*!< (@ 0x0000014C) Transaction started                                        */
        __IM uint32_t RESERVED7[ 44 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED8[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED9[ 125 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable SPIM                                                */
        __IM uint32_t RESERVED10;
        __IOM SPIM_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED11[ 4 ];
        __IOM uint32_t FREQUENCY;               /*!< (@ 0x00000524) SPI frequency. Accuracy depends on the HFCLK
                                                 *                  source selected.                                           */
        __IM uint32_t RESERVED12[ 3 ];
        __IOM SPIM_RXD_Type RXD;                /*!< (@ 0x00000534) RXD EasyDMA channel                                        */
        __IOM SPIM_TXD_Type TXD;                /*!< (@ 0x00000544) TXD EasyDMA channel                                        */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000554) Configuration register                                     */
        __IM uint32_t RESERVED13[ 26 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Over-read character. Character clocked out in
                                                 *                  case and over-read of the TXD buffer.                      */
    } NRF_SPIM_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                           SPIS0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief SPI Slave (SPIS0)
 */

    typedef struct                              /*!< (@ 0x40004000) SPIS0 Structure                                            */
    {
        __IM uint32_t RESERVED[ 9 ];
        __OM uint32_t TASKS_ACQUIRE;            /*!< (@ 0x00000024) Acquire SPI semaphore                                      */
        __OM uint32_t TASKS_RELEASE;            /*!< (@ 0x00000028) Release SPI semaphore, enabling the SPI slave
                                                 *                  to acquire it                                              */
        __IM uint32_t RESERVED1[ 54 ];
        __IOM uint32_t EVENTS_END;              /*!< (@ 0x00000104) Granted transaction completed                              */
        __IM uint32_t RESERVED2[ 2 ];
        __IOM uint32_t EVENTS_ENDRX;            /*!< (@ 0x00000110) End of RXD buffer reached                                  */
        __IM uint32_t RESERVED3[ 5 ];
        __IOM uint32_t EVENTS_ACQUIRED;         /*!< (@ 0x00000128) Semaphore acquired                                         */
        __IM uint32_t RESERVED4[ 53 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED5[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED6[ 61 ];
        __IM uint32_t SEMSTAT;                  /*!< (@ 0x00000400) Semaphore status register                                  */
        __IM uint32_t RESERVED7[ 15 ];
        __IOM uint32_t STATUS;                  /*!< (@ 0x00000440) Status from last transaction                               */
        __IM uint32_t RESERVED8[ 47 ];
        __IOM uint32_t ENABLE;                  /*!< (@ 0x00000500) Enable SPI slave                                           */
        __IM uint32_t RESERVED9;
        __IOM SPIS_PSEL_Type PSEL;              /*!< (@ 0x00000508) Unspecified                                                */
        __IM uint32_t RESERVED10[ 7 ];
        __IOM SPIS_RXD_Type RXD;                /*!< (@ 0x00000534) Unspecified                                                */
        __IOM SPIS_TXD_Type TXD;                /*!< (@ 0x00000544) Unspecified                                                */
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000554) Configuration register                                     */
        __IM uint32_t RESERVED11;
        __IOM uint32_t DEF;                     /*!< (@ 0x0000055C) Default character. Character clocked out in case
                                                 *                  of an ignored transaction.                                 */
        __IM uint32_t RESERVED12[ 24 ];
        __IOM uint32_t ORC;                     /*!< (@ 0x000005C0) Over-read character                                        */
    } NRF_SPIS_Type;                            /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                          GPIOTE                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief GPIO Tasks and Events (GPIOTE)
 */

