FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
    typedef struct                              /*!< (@ 0x40006000) GPIOTE Structure                                           */
    {
        __OM uint32_t TASKS_OUT[ 8 ];           /*!< (@ 0x00000000) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is configured in CONFIG[n].POLARITY.                       */
        __IM uint32_t RESERVED[ 4 ];
        __OM uint32_t TASKS_SET[ 8 ];           /*!< (@ 0x00000030) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is to set it high.                                         */
        __IM uint32_t RESERVED1[ 4 ];
        __OM uint32_t TASKS_CLR[ 8 ];           /*!< (@ 0x00000060) Description collection: Task for writing to pin
                                                 *                  specified in CONFIG[n].PSEL. Action on pin
                                                 *                  is to set it low.                                          */
        __IM uint32_t RESERVED2[ 32 ];
        __IOM uint32_t EVENTS_IN[ 8 ];          /*!< (@ 0x00000100) Description collection: Event generated from
                                                 *                  pin specified in CONFIG[n].PSEL                            */
        __IM uint32_t RESERVED3[ 23 ];
        __IOM uint32_t EVENTS_PORT;             /*!< (@ 0x0000017C) Event generated from multiple input GPIO pins
                                                 *                  with SENSE mechanism enabled                               */
        __IM uint32_t RESERVED4[ 97 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED5[ 129 ];
        __IOM uint32_t CONFIG[ 8 ];             /*!< (@ 0x00000510) Description collection: Configuration for OUT[n],
                                                 *                  SET[n], and CLR[n] tasks and IN[n] event                   */
    } NRF_GPIOTE_Type;                          /*!< Size = 1328 (0x530)                                                       */



/* =========================================================================================================================== */
/* ================                                           SAADC                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Analog to Digital Converter (SAADC)
 */

    typedef struct                                 /*!< (@ 0x40007000) SAADC Structure                                            */
    {
        __OM uint32_t TASKS_START;                 /*!< (@ 0x00000000) Start the ADC and prepare the result buffer in
                                                    *                  RAM                                                        */
        __OM uint32_t TASKS_SAMPLE;                /*!< (@ 0x00000004) Take one ADC sample, if scan is enabled all channels
                                                    *                  are sampled                                                */
        __OM uint32_t TASKS_STOP;                  /*!< (@ 0x00000008) Stop the ADC and terminate any on-going conversion         */
        __OM uint32_t TASKS_CALIBRATEOFFSET;       /*!< (@ 0x0000000C) Starts offset auto-calibration                             */
        __IM uint32_t RESERVED[ 60 ];
        __IOM uint32_t EVENTS_STARTED;             /*!< (@ 0x00000100) The ADC has started                                        */
        __IOM uint32_t EVENTS_END;                 /*!< (@ 0x00000104) The ADC has filled up the Result buffer                    */
        __IOM uint32_t EVENTS_DONE;                /*!< (@ 0x00000108) A conversion task has been completed. Depending
                                                    *                  on the mode, multiple conversions might
                                                    *                  be needed for a result to be transferred
                                                    *                  to RAM.                                                    */
        __IOM uint32_t EVENTS_RESULTDONE;          /*!< (@ 0x0000010C) A result is ready to get transferred to RAM.               */
        __IOM uint32_t EVENTS_CALIBRATEDONE;       /*!< (@ 0x00000110) Calibration is complete                                    */
        __IOM uint32_t EVENTS_STOPPED;             /*!< (@ 0x00000114) The ADC has stopped                                        */
        __IOM SAADC_EVENTS_CH_Type EVENTS_CH[ 8 ]; /*!< (@ 0x00000118) Peripheral events.                                         */
        __IM uint32_t RESERVED1[ 106 ];
        __IOM uint32_t INTEN;                      /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                   /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                   /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED2[ 61 ];
        __IM uint32_t STATUS;                      /*!< (@ 0x00000400) Status                                                     */
        __IM uint32_t RESERVED3[ 63 ];
        __IOM uint32_t ENABLE;                     /*!< (@ 0x00000500) Enable or disable ADC                                      */
        __IM uint32_t RESERVED4[ 3 ];
        __IOM SAADC_CH_Type CH[ 8 ];               /*!< (@ 0x00000510) Unspecified                                                */
        __IM uint32_t RESERVED5[ 24 ];
        __IOM uint32_t RESOLUTION;                 /*!< (@ 0x000005F0) Resolution configuration                                   */
        __IOM uint32_t OVERSAMPLE;                 /*!< (@ 0x000005F4) Oversampling configuration. OVERSAMPLE should
                                                    *                  not be combined with SCAN. The RESOLUTION
                                                    *                  is applied before averaging, thus for high
                                                    *                  OVERSAMPLE a higher RESOLUTION should be
                                                    *                  used.                                                      */
        __IOM uint32_t SAMPLERATE;                 /*!< (@ 0x000005F8) Controls normal or continuous sample rate                  */
        __IM uint32_t RESERVED6[ 12 ];
        __IOM SAADC_RESULT_Type RESULT;            /*!< (@ 0x0000062C) RESULT EasyDMA channel                                     */
    } NRF_SAADC_Type;                              /*!< Size = 1592 (0x638)                                                       */



/* =========================================================================================================================== */
/* ================                                          TIMER0                                           ================ */
/* =========================================================================================================================== */


/**
 * @brief Timer/Counter 0 (TIMER0)
 */

