FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
    typedef struct                              /*!< (@ 0x40008000) TIMER0 Structure                                           */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start Timer                                                */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop Timer                                                 */
        __OM uint32_t TASKS_COUNT;              /*!< (@ 0x00000008) Increment Timer (Counter mode only)                        */
        __OM uint32_t TASKS_CLEAR;              /*!< (@ 0x0000000C) Clear time                                                 */
        __OM uint32_t TASKS_SHUTDOWN;           /*!< (@ 0x00000010) Deprecated register - Shut down timer                      */
        __IM uint32_t RESERVED[ 11 ];
        __OM uint32_t TASKS_CAPTURE[ 6 ];       /*!< (@ 0x00000040) Description collection: Capture Timer value to
                                                 *                  CC[n] register                                             */
        __IM uint32_t RESERVED1[ 58 ];
        __IOM uint32_t EVENTS_COMPARE[ 6 ];     /*!< (@ 0x00000140) Description collection: Compare event on CC[n]
                                                 *                  match                                                      */
        __IM uint32_t RESERVED2[ 42 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED3[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED4[ 126 ];
        __IOM uint32_t MODE;                    /*!< (@ 0x00000504) Timer mode selection                                       */
        __IOM uint32_t BITMODE;                 /*!< (@ 0x00000508) Configure the number of bits used by the TIMER             */
        __IM uint32_t RESERVED5;
        __IOM uint32_t PRESCALER;               /*!< (@ 0x00000510) Timer prescaler register                                   */
        __IM uint32_t RESERVED6[ 11 ];
        __IOM uint32_t CC[ 6 ];                 /*!< (@ 0x00000540) Description collection: Capture/Compare register
                                                 *                  n                                                          */
    } NRF_TIMER_Type;                           /*!< Size = 1368 (0x558)                                                       */



/* =========================================================================================================================== */
/* ================                                           RTC0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Real time counter 0 (RTC0)
 */

    typedef struct                              /*!< (@ 0x4000B000) RTC0 Structure                                             */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start RTC COUNTER                                          */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop RTC COUNTER                                           */
        __OM uint32_t TASKS_CLEAR;              /*!< (@ 0x00000008) Clear RTC COUNTER                                          */
        __OM uint32_t TASKS_TRIGOVRFLW;         /*!< (@ 0x0000000C) Set COUNTER to 0xFFFFF0                                    */
        __IM uint32_t RESERVED[ 60 ];
        __IOM uint32_t EVENTS_TICK;             /*!< (@ 0x00000100) Event on COUNTER increment                                 */
        __IOM uint32_t EVENTS_OVRFLW;           /*!< (@ 0x00000104) Event on COUNTER overflow                                  */
        __IM uint32_t RESERVED1[ 14 ];
        __IOM uint32_t EVENTS_COMPARE[ 4 ];     /*!< (@ 0x00000140) Description collection: Compare event on CC[n]
                                                 *                  match                                                      */
        __IM uint32_t RESERVED2[ 109 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED3[ 13 ];
        __IOM uint32_t EVTEN;                   /*!< (@ 0x00000340) Enable or disable event routing                            */
        __IOM uint32_t EVTENSET;                /*!< (@ 0x00000344) Enable event routing                                       */
        __IOM uint32_t EVTENCLR;                /*!< (@ 0x00000348) Disable event routing                                      */
        __IM uint32_t RESERVED4[ 110 ];
        __IM uint32_t COUNTER;                  /*!< (@ 0x00000504) Current COUNTER value                                      */
        __IOM uint32_t PRESCALER;               /*!< (@ 0x00000508) 12 bit prescaler for COUNTER frequency (32768/(PRESCALER+1)).Mu
                                                 *                  t be written when RTC is stopped                           */
        __IM uint32_t RESERVED5[ 13 ];
        __IOM uint32_t CC[ 4 ];                 /*!< (@ 0x00000540) Description collection: Compare register n                 */
    } NRF_RTC_Type;                             /*!< Size = 1360 (0x550)                                                       */



/* =========================================================================================================================== */
/* ================                                           TEMP                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Temperature Sensor (TEMP)
 */

    typedef struct                              /*!< (@ 0x4000C000) TEMP Structure                                             */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Start temperature measurement                              */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Stop temperature measurement                               */
        __IM uint32_t RESERVED[ 62 ];
        __IOM uint32_t EVENTS_DATARDY;          /*!< (@ 0x00000100) Temperature measurement complete, data ready               */
        __IM uint32_t RESERVED1[ 128 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED2[ 127 ];
        __IM int32_t TEMP;                      /*!< (@ 0x00000508) Temperature in degC (0.25deg steps)                        */
        __IM uint32_t RESERVED3[ 5 ];
        __IOM uint32_t A0;                      /*!< (@ 0x00000520) Slope of first piecewise linear function                   */
        __IOM uint32_t A1;                      /*!< (@ 0x00000524) Slope of second piecewise linear function                  */
        __IOM uint32_t A2;                      /*!< (@ 0x00000528) Slope of third piecewise linear function                   */
        __IOM uint32_t A3;                      /*!< (@ 0x0000052C) Slope of fourth piecewise linear function                  */
        __IOM uint32_t A4;                      /*!< (@ 0x00000530) Slope of fifth piecewise linear function                   */
        __IOM uint32_t A5;                      /*!< (@ 0x00000534) Slope of sixth piecewise linear function                   */
        __IM uint32_t RESERVED4[ 2 ];
        __IOM uint32_t B0;                      /*!< (@ 0x00000540) y-intercept of first piecewise linear function             */
        __IOM uint32_t B1;                      /*!< (@ 0x00000544) y-intercept of second piecewise linear function            */
        __IOM uint32_t B2;                      /*!< (@ 0x00000548) y-intercept of third piecewise linear function             */
        __IOM uint32_t B3;                      /*!< (@ 0x0000054C) y-intercept of fourth piecewise linear function            */
        __IOM uint32_t B4;                      /*!< (@ 0x00000550) y-intercept of fifth piecewise linear function             */
        __IOM uint32_t B5;                      /*!< (@ 0x00000554) y-intercept of sixth piecewise linear function             */
        __IM uint32_t RESERVED5[ 2 ];
        __IOM uint32_t T0;                      /*!< (@ 0x00000560) End point of first piecewise linear function               */
        __IOM uint32_t T1;                      /*!< (@ 0x00000564) End point of second piecewise linear function              */
        __IOM uint32_t T2;                      /*!< (@ 0x00000568) End point of third piecewise linear function               */
        __IOM uint32_t T3;                      /*!< (@ 0x0000056C) End point of fourth piecewise linear function              */
        __IOM uint32_t T4;                      /*!< (@ 0x00000570) End point of fifth piecewise linear function               */
    } NRF_TEMP_Type;                            /*!< Size = 1396 (0x574)                                                       */



/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Random Number Generator (RNG)
 */

    typedef struct                              /*!< (@ 0x4000D000) RNG Structure                                              */
    {
        __OM uint32_t TASKS_START;              /*!< (@ 0x00000000) Task starting the random number generator                  */
        __OM uint32_t TASKS_STOP;               /*!< (@ 0x00000004) Task stopping the random number generator                  */
        __IM uint32_t RESERVED[ 62 ];
        __IOM uint32_t EVENTS_VALRDY;           /*!< (@ 0x00000100) Event being generated for every new random number
                                                 *                  written to the VALUE register                              */
        __IM uint32_t RESERVED1[ 63 ];
        __IOM uint32_t SHORTS;                  /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
        __IM uint32_t RESERVED2[ 64 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED3[ 126 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000504) Configuration register                                     */
        __IM uint32_t VALUE;                    /*!< (@ 0x00000508) Output random number                                       */
    } NRF_RNG_Type;                             /*!< Size = 1292 (0x50c)                                                       */



/* =========================================================================================================================== */
/* ================                                            ECB                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief AES ECB Mode Encryption (ECB)
 */

    typedef struct                              /*!< (@ 0x4000E000) ECB Structure                                              */
    {
        __OM uint32_t TASKS_STARTECB;           /*!< (@ 0x00000000) Start ECB block encrypt                                    */
        __OM uint32_t TASKS_STOPECB;            /*!< (@ 0x00000004) Abort a possible executing ECB operation                   */
        __IM uint32_t RESERVED[ 62 ];
        __IOM uint32_t EVENTS_ENDECB;           /*!< (@ 0x00000100) ECB block encrypt complete                                 */
        __IOM uint32_t EVENTS_ERRORECB;         /*!< (@ 0x00000104) ECB block encrypt aborted because of a STOPECB
                                                 *                  task or due to an error                                    */
        __IM uint32_t RESERVED1[ 127 ];
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
        __IM uint32_t RESERVED2[ 126 ];
        __IOM uint32_t ECBDATAPTR;              /*!< (@ 0x00000504) ECB block encrypt memory pointers                          */
    } NRF_ECB_Type;                             /*!< Size = 1288 (0x508)                                                       */



/* =========================================================================================================================== */
/* ================                                            AAR                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Accelerated Address Resolver (AAR)
 */

