FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805.h
    typedef struct                              /*!< (@ 0x40014000) EGU0 Structure                                             */
    {
        __OM uint32_t TASKS_TRIGGER[ 16 ];      /*!< (@ 0x00000000) Description collection: Trigger n for triggering
                                                 *                  the corresponding TRIGGERED[n] event                       */
        __IM uint32_t RESERVED[ 48 ];
        __IOM uint32_t EVENTS_TRIGGERED[ 16 ];  /*!< (@ 0x00000100) Description collection: Event number n generated
                                                 *                  by triggering the corresponding TRIGGER[n]
                                                 *                  task                                                       */
        __IM uint32_t RESERVED1[ 112 ];
        __IOM uint32_t INTEN;                   /*!< (@ 0x00000300) Enable or disable interrupt                                */
        __IOM uint32_t INTENSET;                /*!< (@ 0x00000304) Enable interrupt                                           */
        __IOM uint32_t INTENCLR;                /*!< (@ 0x00000308) Disable interrupt                                          */
    } NRF_EGU_Type;                             /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                           SWI0                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Software interrupt 0 (SWI0)
 */

    typedef struct                              /*!< (@ 0x40014000) SWI0 Structure                                             */
    {
        __IM uint32_t UNUSED;                   /*!< (@ 0x00000000) Unused.                                                    */
    } NRF_SWI_Type;                             /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           NVMC                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Non Volatile Memory Controller (NVMC)
 */

    typedef struct                              /*!< (@ 0x4001E000) NVMC Structure                                             */
    {
        __IM uint32_t RESERVED[ 256 ];
        __IM uint32_t READY;                    /*!< (@ 0x00000400) Ready flag                                                 */
        __IM uint32_t RESERVED1[ 64 ];
        __IOM uint32_t CONFIG;                  /*!< (@ 0x00000504) Configuration register                                     */

        union
        {
            __OM uint32_t ERASEPAGE;            /*!< (@ 0x00000508) Register for erasing a page in code area                   */
            __OM uint32_t ERASEPCR1;            /*!< (@ 0x00000508) Deprecated register - Register for erasing a
                                                 *                  page in code area, equivalent to ERASEPAGE                 */
        };
        __OM uint32_t ERASEALL;                 /*!< (@ 0x0000050C) Register for erasing all non-volatile user memory          */
        __OM uint32_t ERASEPCR0;                /*!< (@ 0x00000510) Deprecated register - Register for erasing a
                                                 *                  page in code area, equivalent to ERASEPAGE                 */
        __OM uint32_t ERASEUICR;                /*!< (@ 0x00000514) Register for erasing user information configuration
                                                 *                  registers                                                  */
        __OM uint32_t ERASEPAGEPARTIAL;         /*!< (@ 0x00000518) Register for partial erase of a page in code
                                                 *                  area                                                       */
        __IOM uint32_t ERASEPAGEPARTIALCFG;     /*!< (@ 0x0000051C) Register for partial erase configuration                   */
    } NRF_NVMC_Type;                            /*!< Size = 1312 (0x520)                                                       */



/* =========================================================================================================================== */
/* ================                                            PPI                                            ================ */
/* =========================================================================================================================== */


/**
 * @brief Programmable Peripheral Interconnect (PPI)
 */

    typedef struct                              /*!< (@ 0x4001F000) PPI Structure                                              */
    {
        __OM PPI_TASKS_CHG_Type TASKS_CHG[ 6 ]; /*!< (@ 0x00000000) Channel group tasks                                        */
        __IM uint32_t RESERVED[ 308 ];
        __IOM uint32_t CHEN;                    /*!< (@ 0x00000500) Channel enable register                                    */
        __IOM uint32_t CHENSET;                 /*!< (@ 0x00000504) Channel enable set register                                */
        __IOM uint32_t CHENCLR;                 /*!< (@ 0x00000508) Channel enable clear register                              */
        __IM uint32_t RESERVED1;
        __IOM PPI_CH_Type CH[ 10 ];             /*!< (@ 0x00000510) PPI Channel                                                */
        __IM uint32_t RESERVED2[ 168 ];
        __IOM uint32_t CHG[ 6 ];                /*!< (@ 0x00000800) Description collection: Channel group n                    */
        __IM uint32_t RESERVED3[ 62 ];
        __IOM PPI_FORK_Type FORK[ 32 ];         /*!< (@ 0x00000910) Fork                                                       */
    } NRF_PPI_Type;                             /*!< Size = 2448 (0x990)                                                       */


